Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79fbf4a8-8f51-4cef-917b-3e00059df530">
    <name>гкс_Влияние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e4aede75-6f77-4f7d-9149-2cd4d20b2f34">
    <name>гкс_ДефектОформленПоТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c71a5eb-8ff5-48ba-99f5-fb9859401460">
    <name>гкс_НомерТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fadb04b-3aaa-4dd8-b305-d053aced95ae">
    <name>гкс_СрочностьВоздействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5d0d56b-7671-492d-a748-7b755db0a10d">
    <name>гкс_КачественнаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID_Ремонта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0e256218-3632-4e2f-81f1-fbae93c7e394">
    <name>гкс_ФайлыФиксации</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="47be0c3c-665b-4830-8574-be2cb00622d6">
    <name>НомерПаспорта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5959fb7d-0181-4005-b007-cc40a2b7939c">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8251a1bd-d678-4dbc-bd21-6454cb89086e">
    <name>УсловиеРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="934cd87a-75d4-4f33-b94c-1a7268168b99">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8bc213a-2aad-4ac9-a27a-66bbeba601f7">
    <name>ВестиУчетСерийныхЗапчастей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="137abfc3-93b5-4dba-b32d-cd523dd8a9d9">
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="708b732b-9137-43b3-a14b-3163cb9aadb2">
    <name>КонтрагентИсполнительРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6a133e9-f30d-4180-b92c-26930eaeb626">
    <name>АдресМестонахождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0b40a8f-b23e-4ea3-8c69-401d995aed0a">
    <name>ВнешнийОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bc8196e3-5978-482f-b439-7243b365e6ef">
    <name>НеУчаствуетВПланировании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d385af4b-7522-4ee2-90b0-42e45425d027">
    <name>КодОР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="83487b6e-133f-4515-acf1-81c067f764b5">
    <name>КодПоОКОФ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6408b474-ecee-4541-9bde-b1f79b146a49">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="411d399d-7893-49c5-833d-49f4491aff6b">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f389921f-a031-4484-9e7c-211c9ff6f3cf">
    <name>ПлановыйГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37be55ce-a45f-4bcb-811a-1111b86c4734">
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94e46aa7-60a7-4a2b-b803-57b6770dd6b9">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c298ffb9-2689-44d1-8554-0f498c0e29f0">
    <name>СрокПолезногоИспользования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3bf26677-1440-4003-bb01-95200a087f95">
    <name>ЭтоАктив</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33da016d-23b6-4b97-af50-ad3d5fcfa32d">
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e407a623-3e39-4b3b-abd5-d2d822581628">
    <name>СтратегияОбслуживания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97b21e2b-4075-4b3f-93d5-4e66ff55ecf2">
    <name>Широта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="63b57671-dba7-4a9b-b406-75124f7407c2">
    <name>Долгота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7036b49-7b66-497d-a122-8cac8c0e7fd9">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0e35030-1cc6-4122-be4c-227beecb8c28">
    <name>ТекСтатусВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b745f16-26f4-4412-a0a1-69e4d7952bb0">
    <name>гкс_ОсновноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f797d16-918d-40e5-946e-e228860a3bf8">
    <name>гкс_КатегорияРиска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

// гкс+ [Релиз 1] Куст 17.03.2020
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "Документторо_ВыявленныеДефекты.Дата,"
		, "Документторо_ВыявленныеДефекты.Дата,
	|	Документторо_ВыявленныеДефекты.гкс_СимптомДефекта КАК гкс_СимптомДефекта,
	// Гкс+[TOIR20-564] Зозуля А.В. от 31.03.2025. Изменено:{
	//|	Документторо_ВыявленныеДефекты.гкс_КатегорияРиска КАК гкс_КатегорияРиска,
	|	Документторо_ВыявленныеДефекты.гкс_СрочностьВоздействия КАК гкс_СрочностьВоздействия,
	// } Гкс-[TOIR20-564] Зозуля А.В. от 31.03.2025.
	|	Документторо_ВыявленныеДефекты.гкс_ОписаниеДефектаСписком КАК гкс_ОписаниеДефектаСписком,
	|	Не гкс_ЕВОБланк.Ссылка Есть Null КАК ЕстьЕВОБланк,");
		
	// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "Документторо_ВыявленныеДефекты.ДатаОбнаружения,"
		, "Документторо_ВыявленныеДефекты.ДатаОбнаружения,
	|	Документторо_ВыявленныеДефекты.гкс_НомерТАГ КАК гкс_НомерТАГ,");
	// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
		
	Список.ТекстЗапроса = "Выбрать Док.ДокументОснование КАК ДокументОснование,
	|	Максимум(Док.Ссылка) КАК Ссылка
	|Поместить ВТ_ЕвоБланки
	|ИЗ
	|Документ.гкс_ЕВОБланк КАК Док
	|Где Док.ПометкаУдаления = Ложь
	|Сгруппировать ПО Док.ДокументОснование
	| ; " 
	+ СтрЗаменить(Список.ТекстЗапроса, "КАК Документторо_ВыявленныеДефекты"
		, "КАК Документторо_ВыявленныеДефекты
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕвоБланки КАК гкс_ЕВОБланк
	|	ПО Документторо_ВыявленныеДефекты.Ссылка = гкс_ЕВОБланк.ДокументОснование");	
	// 
	
	// Гкс+[TOIR20-519] Вялых Д.А. от 29.01.2025. Добавлено:{
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "Документторо_ВыявленныеДефекты.ОбъектРемонта,",
	"Документторо_ВыявленныеДефекты.ОбъектРемонта КАК ФункциональноеМесто,
	|	ВЫРАЗИТЬ("""" КАК Строка(400)) КАК ОбъектРемонтаСтрокой,
	|	ВЫРАЗИТЬ("""" КАК Строка(400)) КАК ТехнологическийНомер,");
	// } Гкс-[TOIR20-519] Вялых Д.А. от 29.01.2025.
	
	НЭлем = Элементы.Добавить("гкс_СимптомДефекта", Тип("ПолеФормы"), Элементы.Список);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Список.гкс_СимптомДефекта";
	//
	// Гкс+[TOIR20-564] Зозуля А.В. от 31.03.2025. Изменено:{
	//НЭлем = Элементы.Добавить("гкс_КатегорияРиска", Тип("ПолеФормы"), Элементы.Список);
	//НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	//НЭлем.ПутьКДанным = "Список.гкс_КатегорияРиска";
	НЭлем = Элементы.Добавить("гкс_СрочностьВоздействия", Тип("ПолеФормы"), Элементы.Список);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Список.гкс_СрочностьВоздействия";
	// } Гкс-[TOIR20-564] Зозуля А.В. от 31.03.2025.
	//
	НЭлем = Элементы.Вставить("ЕстьЕВОБланк", Тип("ПолеФормы"), Элементы.Список, Элементы.Ссылка);
	НЭлем.Заголовок = НСтр("ru='Есть EWO-бланк';en='There is an EWO form'");
	НЭлем.Вид = ВидПоляФормы.ПолеКартинки;
	НЭлем.ПутьКДанным = "Список.ЕстьЕВОБланк";
	НЭлем.КартинкаЗначений = БиблиотекаКартинок.Задача;
	//
	НовыйЭлемент = Элементы.Добавить("список_СтатусСогласования", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.СтатусСогласования";
	//
	НовыйЭлемент = Элементы.Добавить("список_гкс_ОписаниеДефектаСписком", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.гкс_ОписаниеДефектаСписком";
	//
	// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
	НовыйЭлемент = Элементы.Вставить("гкс_НомерТАГ", Тип("ПолеФормы"), Элементы.Список, Элементы.ДефектВыявленВПроцессе);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.гкс_НомерТАГ";
	// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
	// Гкс+[TOIR20-519] Вялых Д.А. от 29.01.2025. Добавлено:{
	НовыйЭлемент = Элементы.Вставить("ОбъектРемонтаСтрокой", Тип("ПолеФормы"), Элементы.Список, Элементы.Подразделение);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ОбъектРемонтаСтрокой";
	НовыйЭлемент.Заголовок = "Объект ремонта";
	
	НовыйЭлемент = Элементы.Добавить("ТехНомер", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ТехнологическийНомер"; 
	НовыйЭлемент.Заголовок = "Технологический №";
	
	НовыйЭлемент = Элементы.Добавить("ФункциональноеМесто", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ФункциональноеМесто"; 
	НовыйЭлемент.Заголовок = "Функциональное место";
	// } Гкс-[TOIR20-519] Вялых Д.А. от 29.01.2025.
	
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
	// гкс+ [Часовые пояса] Куст 09.04.2020
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ТекстыЗамены = Новый Массив();
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документторо_ВыявленныеДефекты.Дата,",
		"ДобавитьКДате(Документторо_ВыявленныеДефекты.Дата, Час, " + Сдвиг + ") КАК Дата,"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документторо_ВыявленныеДефекты.ДатаОбнаружения,",
		"ДобавитьКДате(Документторо_ВыявленныеДефекты.ДатаОбнаружения, Час, " + Сдвиг + ") КАК ДатаОбнаружения,"));
	Список.ТекстЗапроса = гкс_ЧасовыеПоясаВызовСервера.ИзменитьТекстЗапросаФормыСписка(
		Список.ТекстЗапроса, ТекстыЗамены);
	// гкс- [Часовые пояса] Куст 09.04.2020
КонецПроцедуры

&НаСервереБезКонтекста
Процедура гкс_СписокПриПолученииДанныхНаСервереПосле(ИмяЭлемента, Настройки, Строки)
	
	// Гкс+[TOIR20-519] Вялых Д.А. от 29.01.2025. Добавлено:{
	ЗапросДанныхДляДС = Новый Запрос;
	ЗапросДанныхДляДС.Текст ="ВЫБРАТЬ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
	|	ОбъектыРемонтаСсылка.Наименование КАК ОтказавшийЭлементНаименование,
	|	ОбъектыРемонтаСсылка.ТехНомер КАК ОтказавшийЭлементТехНомер
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК ОбъектыРемонтаСсылка
	|		ПО (ОбъектыРемонтаСсылка.Ссылка = торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент)
	|ГДЕ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	Ссылка";	
	
	ЗапросДанныхДляДС.УстановитьПараметр("Ссылка", Строки.ПолучитьКлючи()); 
	
	РезультатЗапроса = ЗапросДанныхДляДС.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		
		ОбъектыРемонта = "";
		ТехнологическийНомер = "";
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОбъектыРемонта = ОбъектыРемонта + ?(ОбъектыРемонта = "", "", ", ") + ВыборкаДетальныеЗаписи.ОтказавшийЭлементНаименование;	
			ТехнологическийНомер = ТехнологическийНомер + ?(ТехнологическийНомер = "", "", ", ") + ВыборкаДетальныеЗаписи.ОтказавшийЭлементТехНомер;
			
		КонецЦикла;
		
		СтрокаСписка = Строки[ВыборкаСсылка.Ссылка]; 
		
		СтруктураПроверки = Новый Структура; 
		
		Если СтрокаСписка.Данные.Свойство("ОбъектРемонтаСтрокой") Тогда
			СтрокаСписка.Данные.ОбъектРемонтаСтрокой = ОбъектыРемонта;
		КонецЕсли;
		Если СтрокаСписка.Данные.Свойство("ТехнологическийНомер") Тогда
			СтрокаСписка.Данные.ТехнологическийНомер = ТехнологическийНомер; 
		КонецЕсли;
		
	КонецЦикла;
	// } Гкс-[TOIR20-519] Вялых Д.А. от 29.01.2025.
	
КонецПроцедуры

#КонецОбласти
